domain_orig/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    side
    {
        type            calculated;
        value           uniform 0;
    }

    blade1
    {
        type            nutkWallFunction;
        value           $internalField;
    }
/*
    blade2
    {
        type            nutkWallFunction;
        value           $internalField;
    }

    blade3
    {
        type            nutkWallFunction;
        value           $internalField;
    }
*/
    overset1
    {
        type            overset;
    }
/*
    overset2
    {
        type            overset;
    }

    overset3
    {
        type            overset;
    }
*/
}


// ************************************************************************* //
