domain_orig/0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

/*turbulentOmega       1.78;*///Motorbike
internalField   uniform 3.5;
/*internalField   uniform .5;*/

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    side
    {
		type	slip;
    }


    blade1
    {
		type	zeroGradient;
		value	uniform	0;
    }
/*
    blade2
    {
		type	zeroGradient;
		value	uniform	0;
    }

    blade3
    {
		type	zeroGradient;
		value	uniform	0;
    }
*/
    overset1
    {
        type            overset;
    }
/*
    overset2
    {
        type            overset;
    }

    overset3
    {
        type            overset;
    }
*/
}


// ************************************************************************* //
