domain_orig/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset1
    {
        patchType            overset;
	type		     zeroGradient;
    }
/*
    overset2
    {
        patchType            overset;
	type		     zeroGradient;
    }

    overset3
    {
        patchType            overset;
	type		     zeroGradient;
    }
*/
    inlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    side
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    blade1
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
/*
    blade2
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    blade3
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
*/
    ".*"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
}

// ************************************************************************* //
