domain_orig/0_org/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus-overset                          |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset1
    {
        type            overset;
	value		uniform 0;
    }
/*
    overset2
    {
        type            overset;
	value		uniform 0;
    }

    overset3
    {
        type            overset;
	value		uniform 0;
    }
*/
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    side
    {
        type            zeroGradient;
    }

    blade1
    {
        type            zeroGradient;
    }
/*
    blade2
    {
        type            zeroGradient;
    }

    blade3
    {
        type            zeroGradient;
    }
*/
    ".*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
