domain_orig/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
{
	name region1;
	type cellZoneSet;
	action new;
	source setToCellZone;
	sourceInfo
	{
		set region1;
	}
}
/*
{
	name region2;
	type cellZoneSet;
	action new;
	source setToCellZone;
	sourceInfo
	{
		set region2;
	}
}
{
	name region3;
	type cellZoneSet;
	action new;
	source setToCellZone;
	sourceInfo
	{
		set region3;
	}
}
*/
);

// ************************************************************************* //


// ************************************************************************* //
